epccs/AVR-Dx_DFP/edc/AVR128DA64.PIC
        <edc:SFRDef edc:_addr="0x4D1" edc:access="n---nnnn" edc:cname="PIN1CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTG">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x4D2" edc:access="n---nnnn" edc:cname="PIN2CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTG">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x4D3" edc:access="n---nnnn" edc:cname="PIN3CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTG">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x4D4" edc:access="n---nnnn" edc:cname="PIN4CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTG">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x4D5" edc:access="n---nnnn" edc:cname="PIN5CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTG">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x4D6" edc:access="n---nnnn" edc:cname="PIN6CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTG">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x4D7" edc:access="n---nnnn" edc:cname="PIN7CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTG">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x4D8" edc:offset="0x108"/>
        <edc:SFRDef edc:_addr="0x5E0" edc:access="-nnnnnnn" edc:cname="EVSYSROUTEA" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="EVOUTA" edc:desc="Event Output A" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="EVOUT on PA2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="EVOUT on PA7" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="EVOUTB" edc:desc="Event Output B" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="EVOUT on PB2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="EVOUT on PB7" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="EVOUTC" edc:desc="Event Output C" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="EVOUT on PC2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="EVOUT on PC7" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="EVOUTD" edc:desc="Event Output D" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="EVOUT on PD2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="EVOUT on PD7" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="EVOUTE" edc:desc="Event Output E" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="EVOUT on PE2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="EVOUT on PE7" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="EVOUTF" edc:desc="Event Output F" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="EVOUT on PF2" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="EVOUTG" edc:desc="Event Output G" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="EVOUT on PG2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="EVOUT on PG7" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E1" edc:access="--nnnnnn" edc:cname="CCLROUTEA" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="LUT0" edc:desc="CCL Look-Up Table 0 Signals" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Out: PA3 In: PA0, PA1, PA2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="Out: PA6 In: PA0, PA1, PA2" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="LUT1" edc:desc="CCL Look-Up Table 1 Signals" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Out: PC3 In: PC0, PC1, PC2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="Out: PC6 In: PC0, PC1, PC2" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="LUT2" edc:desc="CCL Look-Up Table 2 Signals" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Out: PD3 In: PD0, PD1, PD2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="Out: PD6 In: PD0, PD1, PD2" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="LUT3" edc:desc="CCL Look-Up Table 3 Signals" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Out: PF3 In: PF0, PF1, PF2" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="LUT4" edc:desc="CCL Look-Up Table 4 Signals" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Out: PB3 In: PB0, PB1, PB2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="Out: PB6 In: PB0, PB1, PB2" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="LUT5" edc:desc="CCL Look-Up Table 5 Signals" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Out: PG3 In: PG0, PG1, PG2" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="Out: PG6 In: PG0, PG1, PG2" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E2" edc:access="nnnnnnnn" edc:cname="USARTROUTEA" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="USART0" edc:desc="USART0 Signals" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="PA0, PA1, PA2, PA3" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="PA4, PA5, PA6, PA7" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USART1" edc:desc="USART1 Signals" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="PC0, PC1, PC2, PC3" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="PC4, PC5, PC6, PC7" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USART2" edc:desc="USART2 Signals" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="PF0, PF1, PF2, PF3" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="PF4, PF5" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USART3" edc:desc="USART3  Signals" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="PB0, PB1, PB2, PB3" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="PB4, PB5, PB6, PB7" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
