epccs/AVR-Dx_DFP/edc/AVR128DA64.PIC
      <edc:SFRDef edc:access="-nnn---n" edc:addr="0xA4B" edc:cname="INTFLAGS" edc:impl="0x71" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA1">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare 2 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA6C" edc:cname="CMP2" edc:nzwidth="0x10" ltx:memberofperipheral="TCA1"/>
      <edc:SFRDef edc:access="-------n" edc:addr="0xA4E" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA1">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA4F" edc:cname="TEMP" edc:nzwidth="0x8" ltx:memberofperipheral="TCA1"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA76" edc:cname="PERBUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA1"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA78" edc:cname="CMP0BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA1"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA7A" edc:cname="CMP1BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA1"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA7C" edc:cname="CMP2BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA1"/>
    </edc:RegisterMap>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="LUT0_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C0" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="WO0B1" edc:ppsfunction="TCB1" ltx:memberofperipheral="TCB1"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="XY3" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI0" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART0_ALT" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WOAD0" edc:ppsfunction="TCD0" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XY4" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI0" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART0_ALT" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WOB1D0" edc:ppsfunction="TCD0" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XY5" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6"/>
      <edc:VirtualPin edc:name="LUT0_OUT0" edc:ppsfunction="CCL_ALT" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI0" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="WOC2D0" edc:ppsfunction="TCD0" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART0_ALT" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="XY6" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS_ALT" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD0" ltx:memberofperipheral="ZCD0"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD1" ltx:memberofperipheral="ZCD1"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD2" ltx:memberofperipheral="ZCD2"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI0" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="WOD3D0" edc:ppsfunction="TCD0" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0_ALT" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="XY7" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="LUT4_IN0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART3" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO0A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="XY8" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="LUT4_IN1" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART3" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO1A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="XY9" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2"/>
      <edc:VirtualPin edc:name="EVOUT1" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT4_IN2" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C1_ALT" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO2A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART3" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="XY10" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3"/>
      <edc:VirtualPin edc:name="LUT4_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C1_ALT" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO3A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART3" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="XY11" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI1_ALT" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART3_ALT" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="WO0B2" edc:ppsfunction="TCB2_ALT" ltx:memberofperipheral="TCB2"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0_ALT" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO4A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WOAD0" edc:ppsfunction="TCD0_ALT" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XY12" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI1_ALT" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART3_ALT" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="WO0B3" edc:ppsfunction="TCB3" ltx:memberofperipheral="TCB3"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0_ALT" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO5A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WOB1D0" edc:ppsfunction="TCD0_ALT" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XY13" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6"/>
      <edc:VirtualPin edc:name="LUT4_OUT0" edc:ppsfunction="CCL_ALT" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI1_ALT" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C1_ALT2" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="WOC2D0" edc:ppsfunction="TCD0_ALT" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART3_ALT" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="XY14" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7"/>
      <edc:VirtualPin edc:name="EVOUT1" edc:ppsfunction="EVSYS_ALT" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C1_ALT2" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI1_ALT" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="WOD3D0" edc:ppsfunction="TCD0_ALT" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART3_ALT" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="XY15" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0"/>
      <edc:VirtualPin edc:name="LUT1_IN0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO0B2" edc:ppsfunction="TCB2" ltx:memberofperipheral="TCB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1"/>
      <edc:VirtualPin edc:name="LUT1_IN1" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO0B3" edc:ppsfunction="TCB3_ALT" ltx:memberofperipheral="TCB3"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2"/>
      <edc:VirtualPin edc:name="EVOUT2" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT1_IN2" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C0_ALT" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3"/>
      <edc:VirtualPin edc:name="LUT1_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C0_ALT" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI1_ALT2" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART1_ALT" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO0A1" edc:ppsfunction="TCA1_ALT" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI1_ALT2" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART1_ALT" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO1A1" edc:ppsfunction="TCA1_ALT" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6"/>
      <edc:VirtualPin edc:name="LUT1_OUT0" edc:ppsfunction="CCL_ALT" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC0_ALT" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC1_ALT" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC2_ALT" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI1_ALT2" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C0_ALT2" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="WO2A1" edc:ppsfunction="TCA1_ALT" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART1_ALT" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7"/>
      <edc:VirtualPin edc:name="EVOUT2" edc:ppsfunction="EVSYS_ALT" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD0_ALT" ltx:memberofperipheral="ZCD0"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD1_ALT" ltx:memberofperipheral="ZCD1"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD2_ALT" ltx:memberofperipheral="ZCD2"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C0_ALT2" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI1_ALT2" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART1_ALT" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT2_IN0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY16" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="IN" edc:ppsfunction="ZCD0" ltx:memberofperipheral="ZCD0"/>
      <edc:VirtualPin edc:name="LUT2_IN1" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY17" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT2_IN2" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY18" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT2_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY19" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY20" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="AIN5" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY21" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT2_OUT0" edc:ppsfunction="CCL_ALT" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="DAC0" ltx:memberofperipheral="DAC0"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="XY22" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS_ALT" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="XY23" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AGND"/>
    </edc:Pin>
